Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/courts_system/children_court.html.txt.tmx
Source language: en
Languages: ga

source: The Children Act, 2001 created the Children Court, formerly known as the Juvenile Court. The Children Court deals with children under 18 years of age and came into operation in 2002
ga: Chruthaigh Acht na Leanaí 2001 an Chúirt Leanaí, a tugadh Cúirt d'Ógánaigh uirthi roimhe seo Bíonn an Chúirt Leanaí ag déileáil le leanaí faoi 18 mbliana d'aois agus tháinig sé i bhfeidhm i 2002

source: The following information sets out the various rules regarding the Children Court, including the types of cases heard before it, privacy, in-camera rules, etc
ga: Leagann an t-eolas seo a leanas amach na rialacha difriúla maidir leis an gCúirt Leanaí, ina measc na cineálacha cásanna a éistear ann, príobháideachas, rialacha in camera, srl

source: There are also important rules regarding the age of criminal responsibility, particularly as they relate to children
ga: Tá rialacha tábhachtacha ann maidir le haois freagrachta coiriúil, go háirithe sa mhéid is go mbaineann sé le leanaí

source: Operation of the Children Court
ga: Feidhmiú na Cúirte Leanaí

source: The creation of the Children Court by the 2001 Act has attempted to separate court proceedings involving children from those which involve adults
ga: Is iarracht atá i gcruthú na Cúirte Leanaí tríd an Acht 2001 chun imeachtaí cúirte ina bhfuil leanaí i gceist a scaradh uathu siúd ina mbíonn daoine fásta i gceist

source: In general, the Children Court takes place in the District Court building but under Section 71(1)(b) of the 2001 Act should take place in a different room or building, or on a different day or time from other courts
ga: Go ginearálta, bíonn an Chúirt Leanaí ar siúl sa Chúirt Dúiche ach de réir Alt 71(1)(b) den Acht 2001 ba chóir dóibh a bheith ar siúl i seomra nó i bhfoirgneamh difriúil , nó ag am nó ar lá difriúil ó na cúirteanna eile

source: Indeed, judges who sit in the Children Court are required to undergo special training or education as deemed necessary by the President of the District Court
ga: Go deimhin, caithfidh breithiúna atá ina suí ar an gCúirt Leanaí oiliúint nó oideachas speisialta a bheith orthu de réir mar atá sé ag teastáil i súile Uachtaráin na Cúirte Dúiche

source: (This does not apply to judges, who were appointed to the District Court before 15 December, 1995)
ga: (Ní bhaineann sé seo le breithiúna a ceapadh chun na Cúirte Dúiche roimh an 15 Nollaig, 1995)

source: All of the measures contained in the 2001 Act which relate to children and the Children Court are designed in the interest of the child and attempt to ensue that the Children Court operates in a way which has regard to the needs and sensitivities of the children concerned
ga: Tá na beartais ar fad a bhaineann le leanaí agus leis an gCúirt Leanaí san Acht 2001 deartha ar leas an linbh agus déantar iarracht cinntiú go bhfeidhmíonn an Chúirt Leanaí ar bhealach a thógann riachtanais agus íogaireacht na leanaí atá i gceist san áireamh

source: Types of cases heard in the Children Court
ga: Cineálacha cásanna a éistear sa Chúirt Leanaí

source: The Children Court has the power to deal with most criminal offences which have been committed by children
ga: Tá an chumhacht ag an gCúirt Leanaí déileáil leis an gcuid is mó de chionta coiriúla a dhéanann leanaí

source: Hearings for all minor offences are held in the Children Court, as are most serious (indictable) offences
ga: Éistear leis na mionchionta ar fad sa Chúirt Leanaí, chomh maith leis na gcionta is tromchúisí (indíotáilte)

source: Certain offences may not, however, be heard by the Children Court
ga: Tá cionta áirithe nach féidir éisteacht a thabhairt dóibh sa Chúirt Leanaí áfach

source: The crime of manslaughter, for example, must be dealt with in the Central Criminal Court
ga: Caithfear déileáil le cion dúnorgain, mar shampla, sa Chúirt Choiriúil Lárnach

source: This is provided for by Section 75 (1) of the Children Act, 2001
ga: Tá foráil dó seo in Alt 75 (1) d'Acht na Leanaí, 2001

source: In all non-minor offences where a child has been brought before the Children Court the child must be given a choice by the judge (if the judge decides to keep the matter in that court) as to whether the child wants to have the case heard in the Children Court or to go before a judge and jury
ga: Le cionta ar fad nach mionchionta iad ina dtugtar páiste roimh an gCúirt Leanaí caithfidh an breitheamh an rogha a thabhairt don pháiste an bhfuil sé/sí ag iarraidh go n-éistfear an cás sa Chúirt Leanaí nó roimh bhreitheamh agus giúiré (má roghnaíonn an breitheamh an cás a choinneáil sa Chúirt Leanaí)

source: The child may seek the assistance of a parent or guardian in making such a decision
ga: Is féidir leis an bpáiste cabhair tuismitheora nó caomhnóra a lorg chun an cinneadh sin a dhéanamh

source: Under Bunreacht na hEireann (the Irish Constitution) a child has a right to be tried before a jury for non-minor offences
ga: Faoi Bhunreacht na hÉireann tá an ceart ag páiste dul faoi thriail roimh ghiúiré i gcomhair cionta nach mionchionta iad

source: The judge however must be willing to hear the non-minor offences in the Children Court before the child is offered the choice of court
ga: Caithfidh an breitheamh a bheith sásta éisteacht a thabhairt do na cionta tromchúiseacha sa Chúirt Leanaí sula dtugtar rogha cúirte don pháiste áfach

source: Children and adults charged with the same offences
ga: Leanaí agus daoine fásta a chúisítear as na cionta céanna

source: When a child is charged with a summary/minor offence with one or more adults, the offence should be heard in the Children Court
ga: Nuair a chúisítear páiste as cion achomair/mionchion le duine fásta amháin nó níos mó, ba chóir éisteacht a thabhairt don chion sa Chúirt Leanaí

source: The adult will be dealt with as if he or she were before the District Court
ga: Caitear leis an duine fásta mar a bheadh sé/í roimh an gCúirt Dúiche

source: The Children Court may also decide that both child and adult be dealt with in the District Court
ga: Is faoi rogha na Cúirte Leanaí atá sé déileáil leis an bpáiste agus an duine fásta araon sa Chúirt Dúiche

source: In situations where a child and adult are jointly charged with non-minor offences (indictable offences) the child shall be dealt with by the Children Court as if the child was charged on their own
ga: I gcásanna ina gcomhchúisítear páiste agus duine fásta le cionta tromchúiseacha (cionta indíotáilte) caithfidh an Chúirt Leanaí leis an bpáiste ar an gcaoi céanna agus a gcaithfí leis/léi dá gcúiseofaí an páiste leis/léi féin

source: The adult will be dealt with in the normal way that adults are dealt with by the courts for non-minor offences
ga: Caithfear leis an nduine fásta ar an ngnáthbhealach go gcaitheann na cúirteanna le daoine fásta do chionta nach mionchionta iad

source: Different rules apply when a child, who is charged with a serious offence which would normally be dealt with by a higher court than the Children Court, pleads guilty to the offences before the judge of the Children Court has sent the case forward to the higher court
ga: Tá rialacha difriúla ann más rud é go gcúisítear páiste as cion tromchúiseach a bheadh idir lámha ag cúirt níos airde ná an Chúirt Leanaí go hiondúil, agus go bpléadálann sé/sí ciontach as na cionta roimh do bhreitheamh na Cúirte Leanaí an cás a sheoladh ar aghaidh go dtí cúirt níos airde

source: In that case, the judge of the Children Court may send the child to the higher court for sentencing only
ga: Sa chás sin, d'fhéadfadh breitheamh na Cúirte Leanaí an páiste a chuir ar aghaidh go dtí an chúirt níos airde i gcóir gearradh pionóis amháin

source: Before this can happen, however, the child is required to sign a plea of guilty and the court must be satisfied that the child understands the seriousness of the offence and the facts which are alleged against him or her
ga: Sula dtarlaíonn sé seo, áfach, caithfidh an páiste pléadáil chiontachta a shíniú agus caithfidh an chúirt a bheith deimhin de go dtuigeann an páiste cé chomh tromchúiseach is atá an cion agus na fíricí atá líomhnaithe ina c(h)oinne

source: The consent of the Director of Public Prosecutions must also be given
ga: Caithfear cead a fháil ón Stiúrthóir Ionchúiseamh Poiblí freisin

source: Privacy of the Children Court
ga: Príobháideachas na Cúirte Leanaí

source: TheDistrict Court (Children) Rules 2006 places restriction on people entitled to attend a sitting of the Children Court
ga: Cuireann Rialacha na Cúirte Dúiche (Leanaí) 2006 srian ar na ndaoine atá i dteideal freastal ar shuí de chuid Cúirte Leanaí

source: This is commonly known as the in camera rule
ga: Tugtar an riail in camera air seo go minic

source: This rule basically prohibits the holding of proceedings in the Children Court in public
ga: Go bunúsach ciallaíonn an riail seo nach féidir imeachtaí na Cúirte Leanaí a chuir ar siúl go poiblí

source: If any matter is published or broadcast in breach of these prohibitions the person responsible shall be guilty of an offence
ga: Má fhoilsítear nó má chraoltar ábhar ar bith a sháraíonn an cosc seo tá an duine atá freagrach as ciontach as cion

source: The following are a list of persons entitled to attend:
ga: Seo a leanas liosta de na daoine atá i dteideal freastal:

source: • The parties and their legal representatives,
ga: • na páirtithe agus a n-ionadaithe dlí

source: • An adult relative of the child or other adult who attends the court in accordance with Section 91 (6) of the 2001 Act
ga: • Duine fásta atá gaolta leis an bpáiste nó duine fásta eile atá ag freastal ar an gcúirt faoi réir Alt 91 (6) den Acht 2001

source: • Such other persons (if any) as the Court may at its discretion permit to remain
ga: • Duine ar bith eile (más ann dóibh) a thugann an Chúirt cead dóibh fanacht

source: The order or decision of the Court (if any) in any such proceedings are announced in public
ga: Fógraítear ordú nó cinneadh na Cúirte (má bhíonn ceann ar bith ann) go poiblí in imeachtaí mar seo
